# ----------------------------------------------------------------

# int(n) : 將字串n轉換成數字
print("int('97'):", int('97'))

# ----------------------------------------------------------------
sample_list = [3, 2, 1, 5, 4]

# abs(n) : 回傳n的絕對值
print("abs(-10):", abs(-10))

# len(o) : 回傳o的長度(元素個數)，
# o可以是序列（如 string、bytes、tuple、list、range)或集合（如 dictionary、set、frozen set)
print("len([3, 2, 1, 5, 4]):", len([3, 2, 1, 5, 4]))

# sum(list) : 對list的每項求和並傳回總計值
print("sum([3, 2, 1, 5, 4]):", sum([3, 2, 1, 5, 4]))

# max(list) : 對list求出最大
print("max([3, 2, 1, 5, 4]):", max([3, 2, 1, 5, 4]))

# min(list) : 對list求出最小
print("min([3, 2, 1, 5, 4]):", min([3, 2, 1, 5, 4]))

# ----------------------------------------------------------------
